TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
#include <msp430.h>
#include <stdio.h>
#include <string.h>
#include "sensor-library.h"

// setting the reset & mfio pins
SparkFun_Bio_Sensor_Hub::SparkFun_Bio_Sensor_Hub(uint8_t *resetPort, uint8_t *resetOut, uint16_t resetBit, uint8_t *mfioPort, uint8_t *mfioOut, uint16_t mfioBit, uint8_t address)
{

    // set the necessary pins
    _resetPort = resetPort;
    _resetOut = resetOut;
    //    _resetOut = resetPort + 2; // out is always +2 bits offset from port (disabled for now)
    _resetBit = resetBit;

    _mfioPort = mfioPort;
    _mfioOut = mfioOut;
    //    _mfioOut = mfioPort + 2; // out is always +2 bits offset from port
    _mfioBit = mfioBit;

    _address = address;

    if (_resetPort != nullptr)
    {
        *_resetPort |= _resetBit; // set direction to output
        *_resetOut |= _resetBit;  // set pin high
    }

    if (_mfioPort != nullptr)
    {
        *_mfioPort |= _mfioBit; // set direction to output
        *_mfioOut |= _mfioBit;  // set pin high
    }
}

uint8_t SparkFun_Bio_Sensor_Hub::begin()
{

    // validate that pins ARE assigned
    if (_resetPort == nullptr || _mfioPort == nullptr)
    {
        return 0xFF; // MAX32664 general error code
    }

    // pull mfio high in reset for 10ms
    *_mfioOut |= _mfioBit;    // write mfio high
    *_resetOut &= ~_resetBit; // write reset low
    __delay_cycles(10000);    // 10ms delay @ 1MHz

    *_resetOut |= _resetBit; // write reset high
    __delay_cycles(1000000); // 1000ms delay @ 1MHz

    // set mfio to input
    // pulling enable is always offset by 0x06 (P(x) is at 0x06, P(y) is at 0x07 (x = odd #, y = even #))
    *_mfioPort &= ~_mfioBit;
    *(_mfioPort + 0x06) |= _mfioBit;
    *_mfioOut |= _mfioBit;

    // verify MAX32664 returned 0x00 (READ_DEVICE_MODE = 0x02)
    uint8_t responseByte = readByte(READ_DEVICE_MODE, 0x00);
    return responseByte;
}

// same as begin, but inverting some pins being held low/high
uint8_t SparkFun_Bio_Sensor_Hub::beginBootloader()
{

    // validate that pins ARE assigned
    if (_resetPort == nullptr || _mfioPort == nullptr)
    {
        return 0xFF; // MAX32664 general error code
    }

    // pull mfio high in reset for 10ms
    *_mfioOut &= ~_mfioBit;   // write mfio low
    *_resetOut &= ~_resetBit; // write reset low
    __delay_cycles(10000);    // 10ms delay @ 1MHz

    *_resetOut |= _resetBit; // write reset high
    __delay_cycles(50000);   // 50ms delay @ 1MHz for the bootloader

    // set mfio to output
    *_mfioOut |= _mfioBit;

    // verify MAX32664 returned 0x08 (READ_DEVICE_MODE = 0x02)
    uint8_t responseByte = readByte(READ_DEVICE_MODE, 0x00);
    return responseByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readSensorHubStatus()
{
    uint8_t responseByte = readByte(HUB_STATUS, 0x00);
    return responseByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::setOperatingMode(uint8_t selection)
{

    // parameter validation (must be 0x00, 0x02, or 0x08)
    if (selection != EXIT_BOOTLOADER && selection != SFE_BIO_RESET && selection != ENTER_BOOTLOADER)
    {
        return INCORR_PARAM; // 0xEE
    }

    // send mode change
    uint8_t statusByte = writeByte(SET_DEVICE_MODE, 0x00, selection);
    if (statusByte != SFE_BIO_SUCCESS)
    {
        return statusByte;
    }

    // wait for a verification
    __delay_cycles(100000); // 100ms delay @ 1MHz

    // READ_DEVICE_MODE = 0x02
    uint8_t responseByte = readByte(READ_DEVICE_MODE, 0x00);
    return responseByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::configBpm(uint8_t mode)
{

    if (mode != MODE_ONE && mode != MODE_TWO)
    {
        return 0xEE;
    }

    uint8_t status;

    status = setOutputMode(ALGO_DATA);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = setFifoThreshold(0x01); // one sample before interrupt is fired
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = agcAlgoControl(ENABLE); // one sample before interrupt is fired
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = max30101Control(ENABLE);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = maximFastAlgoControl(mode);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    _userSelectedMode = mode;
    _sampleRate = readAlgoSamples();

    __delay_cycles(1000000); // 1 second delay @ 1MHz
    return SFE_BIO_SUCCESS;
}

uint8_t SparkFun_Bio_Sensor_Hub::configSensor()
{
    uint8_t status;

    status = setOutputMode(SENSOR_DATA);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = setFifoThreshold(0x01);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = max30101Control(ENABLE);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = maximFastAlgoControl(MODE_ONE);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    __delay_cycles(1000000); // 1 second delay @ 1MHz
    return SFE_BIO_SUCCESS;
}

uint8_t SparkFun_Bio_Sensor_Hub::configSensorBpm(uint8_t mode)
{

    if (mode != MODE_ONE && mode != MODE_TWO)
    {
        return 0xEE;
    }

    uint8_t status;

    status = setOutputMode(SENSOR_AND_ALGORITHM);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = setFifoThreshold(0x01); // one sample before interrupt is fired
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = max30101Control(ENABLE);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = maximFastAlgoControl(mode);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    _userSelectedMode = mode;
    _sampleRate = readAlgoSamples();

    __delay_cycles(1000000); // 1 second delay @ 1MHz
    return SFE_BIO_SUCCESS;
}

bioData SparkFun_Bio_Sensor_Hub::readBpm()
{
    bioData libBpm = {0};
    uint8_t status = readSensorHubStatus();

    // if we get a communication error
    if (status == 1)
    {
        libBpm.heartRate = 0;
        libBpm.confidence = 0;
        libBpm.oxygen = 0;
        return libBpm;
    }

    numSamplesOutFifo();

    if (_userSelectedMode == MODE_ONE)
    {
        status = readFillArray(READ_DATA_OUTPUT, READ_DATA, MAXFAST_ARRAY_SIZE, bpmArr);
        if (status != SFE_BIO_SUCCESS)
        {
            return libBpm;
        }

